Repository: yamato/perl6doc-jp
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: As a side note, Perl 6 uses the C3 algorithm to linearize the multiple inheritance hierarchies, which is a significant improvement over Perl 5's approach to handling multiple inheritance.
ja: 傍注として、Perl 6は多重継承階層を線形化するためにC3アルゴリズムを使用します。そして、それは多重継承を取り扱うPerl 5のアプローチについての重要な改善です。

source: As compile-time verification is an important feature of roles, it's best to mark your dependencies.
ja: コンパイル時の検証はロールの重要な機能で、あなたの従属物をマークすることは最善です。

source: As demonstrated, the defined(...) function can be used to check if there is a value or not.
ja: 上に示したように、defined(...)関数は値があるかどうか調べるのに使うことができます。

source: As in C, the parentheses are required if you supply the 3-part spec; however, the 3-part loop spec may be entirely omitted to write an infinite loop.
ja: C言語における3部構成の仕様を与えるなら括弧が要求される；けれども、3部構成の仕様は無限ループを書くためには完全に省略できるだろう。

source: As in Perl 5, "our $foo" introduces a lexically scoped alias for a variable in the current package.
ja: Perl 5におけるour $fooは現在のパッケージに変数のためのレキシカルスコープな別名をもたらす。

source: As in Perl 5, it is possible to goto into a lexical scope, but only for lexical scopes that require no special initialization of parameters.
ja: Perl 5におけるレキシカルスコープへのgotoは可能だ。しかし特別なパラメータの初期化を必要としないレキシカルスコープのみだ。

source: As in Perl 5, many built-in functions simply return an undefined value when you ask for a value out of range, or the function fails somehow.
ja: Perl 5にあるようなたくさんのビルトイン関数は、あなたが値が範囲外か問い合わせるか関数がなぜか失敗するときに単純に未定義値を返す。

source: As in many other programming languages, you can use ++ as a prefix.
ja: 多くの他のプログラミング言語のように、あなたは接頭辞として++を使うことができます。

source: As mentioned before, a class can inherit from multiple classes.
ja: 前記したように、クラスは複数のクラスから継承することができます。

source: As mentioned earlier, the loop variable is named by passing a parameter to the closure:
ja: 前に簡単に述べたように、ループ変数はクロージャにパラメータを渡すことで名前が付けられる：

source: As well, Perl is syncretic.
ja: また、Perlは語形融合です。

source: As with an ordinary while, you may optionally bind the result of the conditional expression to a parameter of the block:
ja: 通常のwhileのように、条件式の結果をブロックのパラメータに任意に結びつけるなら：

source: As with calls to return, the warning control exception is an abstraction that the compiler is free to optimize away (along with the associated continuation) when the compiler or runtime can determine that the semantics would be preserved by merely printing out the error and going on.
ja: returnの呼び出しのように、警告制御例外はコンパイラが自由に最適化して取り除く抽象化だ（関連付けられた継続と一緒に）コンパイラかランタイムが決定できるとき、そのセマンティクスは単にエラーと進行をプリントするために保存される。

source: As with conditionals, you may optionally bind the result of the conditional expression to a parameter of the block:
ja: 条件文のように、条件付きの式の結果をブロックのパラメータに任意にバインドするなら：

source: As with modules, the public storage, interface, and name of the class is represented by a package and its name, which is usually (but not necessarily) a global name.
ja: モジュールと同様に、パブリックストレージ、インターフェース、クラス名はパッケージとその名前によって表され、それは通常（しかし必ずではなく）グローバル名です。

source: As with ordinary loop controls, the label is searched for first lexically within the current subroutine, then dynamically outside of it.
ja: 普通のループ制御のように、ラベルは最初に現在のサブルーチン内レキシカルに検索される。その時はそれの外側をダイナミックに。

source: As with other statement prefixes, these value-producing constructs may be placed in front of either a block or a statement:
ja: 他の文接頭辞の様に、それらの値を出す構造はブロックか文の前に配置することもできる：

source: As with the .leave method, there is also a .succeed method to break from a labelled block functioning as a switch:
ja: .leaveメソッドのように、switchとして機能するラベル付きブロックから抜けるための.succeedメソッドもある。

source: Assigning Nil to any entire composite container (such as an Array or Hash) empties the container, resetting it back to an uninitialized state.
ja: Nil全体の複合コンテナ（ArrayやHashのような）に割り当てることはコンテナを空にし、未初期化状態にリセットします。

source: Assigning Nil to any scalar container causes the container to throw out any contents and restore itself to an uninitialized state (after which it will appear to contain an object appropriate to the declared default of the container, where Any is the default default; the element may be simply deleted if that's how the default can be represented in the structure).
ja: Nilを何かのスカラーコンテナに割り当てると、その内容を捨てて初期化されていない状態に戻します（その後コンテナで定義されたデフォルトの適切なオブジェクトを含み、Anyはデフォルトのデフォルトです；デフォルトが構造で表されるなら、要素は単純に削除されます）。

source: Assume that users should be able to enter a list of moves (perhaps on a dance pad or other exotic input device).
ja: ユーザーが動き（おそらくダンスパッドまたは他のエキゾチックな入力デバイスで）のリストを入力することができると仮定してください。

source: At run time, succeed uses a control exception to scan up the dynamic chain to find the call frame belonging to that same outer block, and when it has found that frame, it does a .leave on it to unwind the call frames.
ja: 実行時に、succeedは同じ外側のブロックに属するコールフレームを探すためのダイナミックチェインをスキャンするために制御例外を使う。そしてそのフレームが見つかった時、コールフレームを巻き戻すために.leaveを行う。

source: At the time of writing, only Rakudo supports this..
ja: 書く時点で、Rakudoだけはこれをサポートします。

source: Audience
ja: 読者

source: Avoid writing code like this in anything other than example code.
ja: 例のコード以外のどんなものにもこのようなコードを書くことは避けてください。

source: Backtracking control
ja: バックトラック制御

source: Basic Types
ja: 基本型

source: Be wary of relying on this: when the flow of control within a subroutine is sufficiently complex, adding an explicit return will clarify the code.
ja: これに頼るのは注意してください：サブルーチンの制御フローが十分に複雑な場合は、returnを明示的に加える事はコードを明快にします。

source: Because gather evaluates its block or statement in sink context, this typically causes the take function to be evaluated in sink context.
ja: gatherはそのブロックか文をsinkコンテキストで評価するので、これは典型的にはtake関数がsinkコンテキストで評価されることを引き起こす。

source: Because when statements are executed in order, the default must come last.
ja: なぜならwhen文は順番に実行されるので、defaultは最後に来なければならない。

source: Because Int is a type that conforms to Any, it is a narrower match for an integer.
ja: IntがAnyに従う型であるので、それは整数により狭い匹敵するものです。

source: Because $a and $b are dependencies of each other, none of them would ever get around to calling their callbacks.
ja: $aと$bが互いに従属物であるので、それらのどれもコールバックを呼んで歩き回ることはありません。

source: Because it is possible to go to a label that is after the operation, and because Perl 6 does one-pass parsing, any goto to a label that has not been yet declared (or is declared outside the outward lexical scope of the goto) must enclose the label in quotes.
ja: なぜなら演算の後のラベルに行くことが可能で、Perl 6はワンパス解析を行うので、まだ定義されていない（またはgotoの外側のレキシカルスコープの外に定義された）ラベルへのどれか一つのgotoはラベルをクオートで囲まなければならない。

source: Because of smart matching, ordinary when statements are sufficiently powerful to pattern match the current exception against classes or patterns or numbers without any special syntax for exception handlers.
ja: スマートマッチングにより、通常のwhen文は現在のクラスまたはパターンまたは例外ハンドラのための何らかの特別な文法のない数字に対する例外にマッチするために十分にパワフルだ。

source: Because subroutine declarations are expressions, not statements, this is now invalid:
ja: サブルーチンの宣言は式であり文ではないので、これは今では無効だ：

source: Because the bodies of the subs here do not use the parameters, there's no reason to force the programmer to name them; they're anonymous parameters.
ja: ここのsubの本体がパラメータを使わないので、それらに名をつけることをプログラマーに強制する理由はありません；それらは匿名のパラメータです。

source: Because the calculation is meaningful only for non-negative area values, the parameter includes a constraint which returns True for non-negative values.
ja: 計算は負の数でない範囲の値だけで意味があるので、パラメータは負の数でない値にTrueを返す制約を含んでいます。

source: Because the dispatcher will see the cook method on Baker before it moves up to the parent class the Baker's cook method will be called.
ja: ディスパッチャーは親クラスの前にBakerのcookメソッドを見るので、Bakerのcookメソッドが呼ばれます。

source: Before these two lines execute, %sets is empty.
ja: これら2行を実行する前、%setsは空です。

source: Before you get too happy about this pragma, note that Perl 6 contains various parallel processing primitives that will tend to get blown up prematurely by thrown exceptions.
ja: このプラグマでハッピーになる前に、Perl 6はスローされた例外によって早まって爆発しがちな様々な並行処理プリミティブを含むので注意。

source: Besides calling them, you can learn things about them, including the details of their parameters:
ja: それらを呼ぶ他に、あなたはパラメータの詳細も含めてそれらについて調べることができます。

source: Besides operators, other syntactic elements coerce their elements: if and while coerce to truth values (Bool), for views things as lists, and so on.
ja: 演算子の他に、他の構文要素はそれらの要素を自動型変換します：ifとwhileは真偽値（Bool）に自動型変換し、forはものをリストとして見るなどです。

source: Between letters you can also use a dash - or an apostrophe ', so isn't and double-click are valid identifiers.
ja: 文字の間にダッシュ（-）またはアポストロフィ（'）を使うこともできます。したがって「isn't」と「double-click」は識別子として有効です。

source: Beyond this, traits (traits) allow you to associate extra data with parameters.
ja: これの他に、トレイトは追加のデータをパラメータと結びつけることができます。

source: Bindability checks
ja: バインド可能性のチェック

source: Binding of Nil with := simply puts Nil in the container.
ja: Nilを:=てバインドすることは単純にコンテナにNilを置きます。

source: Binding this node to a function could use the appropriate parameter syntax to work with various children and attributes.
ja: このノードを関数に結びつけることは、いろいろな子と属性で動作に適切なパラメータ構文を使うことができるはずです。

source: Blocks are delimited by curlies, or by the beginning and end of the current compilation unit (either the current file or the current eval string).
ja: ブロックはカーリーブラケットか、現在のコンパイル単位によって区切られる（現在のファイルか現在のeval文字列）。

source: Both Perl 5 and Perl 6 have active developer communities which mold the languages.
ja: Perl 5とPerl 6には、言語を形作る活発な開発者コミュニティがあります。

source: Both Perl 5 and Perl 6 share these attributes to varying degrees.
ja: Perl 5とPerl 6は、これらの特質を共有します。

source: Both have a named capture.
ja: 両者とも、名前付きキャプチャーを持っています。

source: Both of these design techniques appear in the example code.
ja: これらのデザインテクニックは両方とも、コード例で出現します。

source: Both players independently select a symbol (rock, paper, or scissors).
ja: 両方のプレーヤーは、シンボル（岩、紙またははさみ）を独立して選びます。

source: Both the AnswerToAll and AnswerIfTalkedTo roles provide a method named process.
ja: AnswerToAllとAnswerIfTalkedToロールは両方ともprocessという名前のメソッドを提供します。

source: Bracketing Characters
ja: ブラケット文字

source: Building a class out of roles uses a safe mechanism called flattening composition.
ja: クラスをロールから構築することは、平坦化合成と呼ばれる安全なメカニズムを使います。

source: Built-In Data Types
ja: ビルトインデータ型

source: Built-in types, operators and methods
ja: 組み込みの型、演算子、メソッド

source: But state automatically applies "once" semantics to any initializer, so this also works:
ja: しかしstateはどんなイニシャライザにも自動的に「once」セマンティクスを適用するので、これも動作する：

source: But as always, you must use them all:
ja: しかしいつも通り、それらを全て使う必要がある：

source: But beware that parenthesis directly after an identifier -- without any whitespace between -- are always parsed as the argument list, so
ja: しかし識別子の後にくる直接の括弧 ― 間に空白のない ― は常に引数リストとしてパースされます。そのため

source: But generally that means you should refactor instead.)
ja: しかし一般には代わりにリファクターするべきだということを意味する。）

source: But there are other applications too: a routine that serializes objects to a bunch of bytes needs to know the attributes of that object, which it can find out via introspection.
ja: しかし、他の適用もあります：多くのバイトにオブジェクトをシリアライズするルーチンはそのオブジェクトの属性を知っている必要があり、そしてそれはイントロスペクションを通して発見することができます。

source: But these two are valid:
ja: しかしこれら二つは有効だ：

source: But to do that, it may eventually have to peel back any number of layers of dynamic call frames internal to the subroutine's current call frame.
ja: それを行うためには、結局は皮をむき、ダイナミックコールフレーム内部のたくさんのレイヤーからサブルーチンの現在のコールフレームへ戻らなければならないかもしれない。

source: But use of a default block is good documentation.
ja: しかしdefaultブロックの使用はよいドキュメンテーションだ。

source: By contrast, a mutable object may be changed after being created.) to a parameter that has the is rw trait, the binding will fail at the time of the call and throw an exception:
ja: 対照的に、可変オブジェクトは作成後に変更することができます。）にis rwトレイトをつけて渡すと、呼び出し時にバインディングが失敗して例外をスローします：

source: By contrast, the :U adverb can be used to indicate that the parameter requires an undefined or abstract object.
ja: 対照的に、:U副詞はパラメータが未定義か抽象オブジェクトを必要とすることを示すのに使えます。

source: By default the innermost call frame matching the selection criteria will be exited.
ja: デフォルトでは選択基準にマッチする最も深いコールフレームは抜けだされる。

source: By default the second declaration will get a compiler warning.
ja: デフォルトでは、二回目の宣言はコンパイラーの警告が出るだろう。

source: By default, subst performs a single match and stops.
ja: デフォルトでsubstは一つのマッチを実行して止まります。

source: By default, subroutines are lexically scoped, just like any variable declared with my.
ja: デフォルトではmyで宣言された変数のように、サブルーチンはレキシカルスコープです。

source: By default, whitespace inside the regex is irrelevant for the matching, so writing the regex as m/ perl /, m/perl/ or m/ p e rl/ all produce the exact same semantics--although the first way is probably the most readable.
ja: デフォルトでは正規表現の内側の空白文字はマッチに無関係で、m/ perl /、m/perl/またはm/ p e rl/のように正規表現を書くとすべて同じ意味となります ― しかし、最初が多分最も読みやすいでしょう。

source: Calculations involving Num numbers are usually quite fast, though subject to limited precision.
ja: 限られた精度の影響を受けるけれども、Numを含んでいる計算は通常はかなり速いです。

source: Calling make $thing in an action method sets the ast attribute of the current match object to $thing.
ja: アクションメソッドでのmake $thingの呼び出しは、現在のマッチオブジェクトのast属性を$thingにセットします。

source: Calling all candidates
ja: すべての候補を呼び出す

source: Calling the swap routine with an immutable value (for example a number literal) will fail.
ja: swapルーチンを不変の値（たとえば数値リテラル）で呼ぶことは失敗するでしょう。

source: Calling this script without command line arguments leaves all three parameters at their default values.
ja: コマンドライン引数なしにスクリプトを呼び出すと、3つのパラメータはデフォルト値になります。

source: Candidate signatures may contain any number of positional and named arguments, both explicit and slurpy.
ja: 候補シグネチャーは、多くの前後関係に依存して名をつけられた引数（明確で大食いな）を含みます。

source: Candidates can specify more complex signatures:
ja: 候補はより複雑なシグネチャを指定することができます：

source: Captures
ja: キャプチャー

source: Captures In Signatures
ja: シグネチャー内のキャプチャー

source: Captures have both positional and named parts which act like lists and hashes.
ja: キャプチャーはリストとハッシュのように振る舞う位置依存と名前付きの部分を持っています。

source: Cases where an arbitrary number of arguments are allowed are handled with slurpy parameters instead:
ja: 任意の数の引数が許可されるケースは、その代わりにslurpyなパラメータで取り扱われます：

source: Changes to run-time properties are done via mixin instead, so that the compiler can optimize based on declared traits.
ja: 実行時のプロパティの変化は代わりにミックスインで行われます。そのためコンパイラは宣言されたトレイトを元に最適化できます。

source: Chapter 2 demonstrated simple subroutines.
ja: 第2章は単純なサブルーチンを示しました。

source: Chapter link showed how to use nested signatures to look deeper into data structures and extract parts of them.
ja: 章のリンクはデータ構造の中により深く見て、それらの部分を抜き出すために入れ子になったシグネチャを使用する方法を示しました。

source: Choose them carefully!
ja: それらは慎重に選んでください！

source: Class declarations frozen at compilation time are often sufficient, but sometimes it's useful to add new behaviors to individual objects.
ja: コンパイル時で凍結されるクラス宣言はしばしば十分ですが、新しい振る舞いを個々のオブジェクトに加えることは時々有用です。

source: Classes
ja: クラス

source: Classes and Objects
ja: クラスとオブジェクト

source: Code that is generated at run time can still fire off CHECK and INIT phasers, though of course those phasers can't do things that would require travel back in time.
ja: 実行時に生成されるコードはCHECKとINIT phasersをまだ発射できる。けれどももちろんそれらのphasersは時間内に行ったり来たりすることを要求することができない。

source: Coercive type declarations
ja: 制約型宣言

source: Comparisons and Smart Matching
ja: 比較とスマートマッチング

source: Compile Time Composition
ja: コンパイル時合成

source: Computer scientists call this a stable sort.
ja: コンピューターサイエンスの専門家はこれをステーブルソートと呼びます。

source: Conditional statement modifiers work as in Perl 5.
ja: 条件付き文の修飾子はPerl 5のように動作する。

source: Conditional statements
ja: 条件付きの文

source: Consider a module that provided the example from the "Optional Parameters" section:
ja: 「オプションのパラメータ」セクションで提供されている例のモジュールを考えてください：

source: Consider quicksort.
ja: クイックソートを考えてください。

source: Consider the class definition:
ja: クラス定義についてよく考えてください：

source: Consider the second method, add-dependency, which adds a new task to this task's dependency list.
ja: 第2のメソッドを考慮してください、add-dependencyは新しい仕事をこの仕事の依存リストに加えます。

source: Consider the table tennis example from the previous chapter.
ja: 前の章の卓球の例を考えてください。

source: Constants (and enums) default to our scoping so they can be accessed from outside the package.
ja: 定数（と列挙型）はourスコープで初期化されるので、外側のパッケージからアクセスできる。

source: Constraint checking occurs next, and only if the constraint check of the narrowest candidate fails, other candidates are tried that are lass narrow by nominal type.
ja: チェックしている制約は次に出現します。そして最も制限された候補失敗の制約チェックがある場合だけ、名目上の型によって制限された娘である他の候補は裁判にかけられます。

source: Constraints
ja: 制約

source: Constraints and container types can be used together:
ja: 制約とコンテナ型は一緒に使うことができます。

source: Constructors
ja: コンストラクタ

source: Constructs marked with a * have a run-time value, and if evaluated earlier than their surrounding expression, they simply save their result for use in the expression later when the rest of the expression is evaluated:
ja: *でマークされた構造は実行時の値を持つ。そしてそれらを囲う文より早く評価されたら、それらは文の残りが評価された時に後で文で使うために単純に結果を保存する：

source: Constructs such as if automatically evaluate their conditions in boolean context.
ja: ifのような構造はそれらを自動的にブール値コンテキストで評価します。

source: Consuming our class
ja: 自分のクラスを使う

source: Container Types
ja: コンテナ型

source: Container types
ja: コンテナ型

source: Container types such as lists and hashes evaluate to False if they are empty, and to True if they contain at least one value.
ja: リストとハッシュのようなコンテナ型はそれらが空ならFalse、少なくとも1つの値を含んでいればTrueです。

source: Containers enforce type safety on setting, whereas subroutines enforce type safety on return.
ja: コンテナはセット時に型安全を強制するのに対し、サブルーチンはreturn時に型安全を強制します。

source: Contents
ja: 内容

source: Control exceptions may be caught with a CONTROL block.
ja: 制御例外はCONTROLブロックでキャッチできる。

source: Conversely, $x.substr implies conversion to a string or buffer type.
ja: 反対に、$x.substrは文字列かバッファー型への変換を含みます。

source: Creating And Using A Capture
ja: キャプチャーの作成と使用

source: Currying
ja: カリー

source: Currying gives you a shortcut for these exact cases; it creates a new sub from an existing sub, with parameters already filled in.
ja: カリーはこれらの例に対してショートカットを与えます；それは存在するサブルーチンからパラメータがすでに満たされた状態で新しいサブルーチンを作成します。

source: Declarators generally make the colon optional:
ja: 宣言文は一般にコロンを任意にします：

source: Declaring a Subroutine
ja: サブルーチンの宣言

source: Declaring a class creates a type object which, by default, is installed into the current package (just like a variable declared with our scope).
ja: クラスの宣言は型オブジェクトを作ります。それはデフォルトでは現在のパッケージに設置されます（ちょうどourスコープで変数を宣言するように）。

source: Declaring a custom constructor provides a simple way of declaring tasks along with their dependencies.
ja: カスタムコンストラクタを宣言することは、それらの従属物とともにタスクを宣言するシンプルな方法を提供します。

source: Defining a container type is the Perl 6 equivalent to tying a variable in Perl 5.
ja: コンテナ型を定義することはPerl 5のタイ変数のPerl 6の同等物です。

source: Description
ja: 説明

source: Differences from compile time composition
ja: コンパイル時合成との違い

source: Disabling backtracking makes \w+ always match a full word:
ja: バックトラックを無効にすることは、常に\w+をフルワードにマッチさせます：

source: Do the latter by installing a proto routine:
ja: protoルーチンをインストールすることによって、後者をしてください：

source: Double quoted strings in Perl 6 can interpolate variables with the $ sigil as well as blocks of code in curly braces.
ja: Perl 6のダブルクォート付きの文字列は$シギルと同様にブレース内のコードのブロックを変数展開できます。

source: During the first iteration, $line will contain the string Ana Dave | 3:0; during the second, Charlie Beth | 3:1, and so on.
ja: 最初の繰り返しの間、$lineは文字列Ana Dave | 3:0を含みます；2番目以降はCharlie Beth | 3:1などのようになります。

source: Each alternative has a name of the form token value:sym<thing>, which can be read as alternative of value with parameter sym set to thing.
ja: 各々の選択肢はtoken value:sym<thing>という形式の名前を持っています。それはパラメータsymにthingにセットするvalueの選択肢と解釈されることができます。

source: Each chapter opens with a reasonably complete example that illustrates the topic of the chapter.
ja: 各々の章は、章の主題を例示する適度に完成した例で始まります。

source: Each iteration's value is returned as a single "argument" object.
ja: それぞれの反復の値は一つの「引数」オブジェクトとして返される。

source: Each line will contain a key, followed by a tab character, then the value associated with that key, and finally a newline.
ja: それぞれの行はタブ文字が続くキーを含むでしょう。そしてそのキーに結びついている値、最後に改行文字です。

source: Each match object has a slot called ast (short for abstract syntax tree) for a payload object.
ja: 各々のマッチオブジェクトは、ペイロード（データ本体）オブジェクトのためにast（抽象構文木の略）と呼ばれるスロットを持っています。

source: Each multi dispatch builds a list of candidates, all of which satisfy the nominal type constraints.
ja: 各々のマルチディスパッチは候補のリストを構築します。そしてその全ては名目型制約を満たします。

source: Each of the token and rule declarations are just regex declarations with special default behavior.
ja: tokenとrule宣言の各々は、特別なデフォルト動作によるただのregex宣言です。

source: Each of these objects describes one parameter in detail.
ja: これらのオブジェクトの各々は、詳細に1つのパラメータを記述します。

source: Each subsequent clone gets an initial state that is one higher than the previous, and each clone maintains its own state of $x, because that's what state variables do.
ja: それぞれの後に続く複製は前よりも1高い初期stateを得る。そしてそれぞれのクローンは独自の$xのstateをstate変数がするように扱う。

source: Embedded Comments
ja: 埋め込みコメント

source: Empty strings and "0" evaluate to False.
ja: 空文字列と"0"はFalseと評価する。

source: Enclosing a regex name in angle brackets causes the regex engine to attempt to match a regex by that name within the same grammar.
ja: 正規表現名をアングルブラケットで囲むことは、正規表現エンジンに同じ文法の範囲内でその名前によって正規表現にマッチしようとさせます。

source: Equivalent Assertion
ja: 同等のアサーション

source: Even if the two arrays @a and @b contain the same values, if their containers are two separate array objects, they will have different identities and will not be equivalent when compared with ===:
ja: もし2つの配列@aと@bが同じ値を含むとしても、コンテナが2つの別々の配列オブジェクトであるならば、それらは異なる同一性を持ち、===で比較されるとき等しくないでしょう：

source: Even in the absence of closure cloning, INIT runs before the mainline code, while once puts off the initialization till the last possible moment, then runs exactly once, and caches its value for all subsequent calls (assuming it wasn't called in sink context, in which case the once is evaluated once only for its side effects).
ja: クロージャの複製なしでも、INITはメインラインコードの前に実行する。onceが最後の可能な時まで延期する間、一度実行し、後の呼び出しのために値をキャッシュする（sinkコンテキストで呼ばれないと仮定し、onceが副作用のために1回だけ評価される場合）。

source: Even releases will contain some amount of TODO comments prior to the printing of the book.
ja: リリースでさえ、本をプリントするまえにTODOコメントをいくらか含みます。

source: Even so, $/.caps follows the ordering of the string, not of the regex.
ja: それでも$/.capsは正規表現ではなく文字列の順位付けに従います。

source: Even so, we pray the reader's indulgence and understanding.
ja: それでも、我々は読者の寛大さと理解を願います。

source: Even though they share a name, the methods perform semantically different--and conflicting--behaviors.
ja: たとえそれらが名前を共有するとしても、そのメソッドは意味論的に異なり ― そして競合する ― 振る舞いを実行します。

source: Every Perl 6 program should begin with use v6;.
ja: あらゆるPerl 6プログラムはuse v6;で始まるべきです。

source: Every block is a closure.
ja: 全てのブロックはクロージャだ。

source: Every candidate resembles:
ja: すべての候補は似ています：

source: Every object can produce a "WHICH" value that uniquely identifies the object for hashing and other value-based comparisons.
ja: 全てのオブジェクトはハッシュと他の値ベースの比較のためにオブジェクトをユニークに識別する“WHICH”値を生成することができます。

source: Every regex match returns an object of type Match.
ja: すべての正規表現マッチはMatch型のオブジェクトを返します。

source: Every subsequent line records a result of a match.
ja: 以降のすべての行は試合の結果を記録しています。

source: Everything else within a lift is assumed to mean something in the caller's linguistic context.
ja: liftの中の他のすべてのものは呼び出し元の言語のコンテキストの何かを意味すると仮定される。

source: Example calls to this script:
ja: スクリプトの呼び出し例：

source: Examples
ja: 例

source: Except for such formal parameter declarations, all lexically scoped declarations are visible from the point of declaration to the end of the enclosing block.
ja: このような仮パラメータ宣言を除いて、すべてのレキシカルスコープの宣言は宣言の時点から取り囲むブロックの終了ま可視だ。

source: Exception handlers
ja: 例外ハンドラ

source: Exception handlers are supposed to reduce uncertainty, not increase it.)
ja: 例外ハンドラは不確実に減らすと思われる。増加ではない。）

source: Exceptions are not resumable in Perl 6 unless the exception object does the Resumable role.
ja: 例外オブジェクトがResumableロールを行わない限り例外はPerl 6で再開可能ではない。

source: Exercises
ja: 練習問題

source: Explicit types are optional.
ja: 型の明示は任意です。

source: Expressing requirements
ja: 必要条件を表す
